module Messages(initMsg,msgR,msgW,msgs) where

initMsg="不思議なところ・・・。\nここは どこだらう・・・。\n＜キーボードなら hjklキーを。\nタッチなら 画面の端をタップすることで 動けさうです＞{e.bC.m1:s0C0:1:s0C1:1:s0C2:0:s0C3}{e.==.m1:s0c}{e.b9.m1:s090}{e.b8.m1:s080}{e.b3.m1:s030}{e.b2.m1:s020}{e.b1.jl3}{e.c0&s3.m1:s3}"

s0C0="\n「やあ。\nわあ！。 なんか文字がしゃべった！。\n「文字ぢゃないよ。\n「僕は ねこだよ。\nいや ねこも 普通しゃべらないし。\n「どうだい？。 次に進めさうかい？。\n次っていっても よくわからないけど・・・。\nまあ 自分で何とかやってみるよ。\n「ふぅ〜ん。まあ いいや。\n「僕の助けが必要なら 言ってね。\n・・・・。{ct.1.Fr}{ct.2.Fr}{ct.3.Fr}{ct.7.Fr}{ct.8.Fr}{ct.9.Fr}"

s0C1="\n「この世界には 持てるモノ。 持てないモノ。 動かせるモノ。 動かないモノ とかが あるよ。\n「持ったものを 自分のゐる所に置く場合は キーボードなら スペースキー。\n「タッチなら まんなか邊：へん：をタップ かな。"

s0C2="\n「一番上の行に =＜イコール＞ があるでしょ？。\n「イコール は その左と 右が 等しい ってことだよ。\n「イコール の左と右を等しくしてあげれば きっと前に進めるはずだよ。"

s0C3="\n「上の等式を完成させやう"

s0c="\n「オッケー！ 簡：かん：單：たん：だった？。{d.bC}{e.bC.m0:s0C4}\n「それぢゃあ 次：つぎ：の部：へ：屋：や：へいこっか{p.2,4.n,Ex}{e.un.l}{e.c0.m1:s1}"

s0C4="\n「次の部屋へ いかうよ"

s1="\nあれ？。どこ行った？。\n「ぼくのことを 氣にかけてくれるんだ。 ありがたう！。\n「ちょっとここには 居：ゐ：ないけど 言葉は聞こへてるでしょ？。\n「何かあったら また繋：つな：がるから 大丈夫だよ〜。\nつながる？ まあいいや。\nてか ここは何だ？。{da}{e.b=0.m0:s1Q1}{e.b=1.m0:s1Q2}{e.b=2.m0:s1Q3}{e.bS.m1:s1S0}{e.vC.m1:s1C0}{e.bJ.m1:s1J0:1:s1J1}{e.uR.r}{e.==.m1:s1c}"

s1Q1="\n温室効果の比較的高いガスは？"

s1Q2="\n地球の気温は時代によって大きく變化してきた？"

s1Q3="\n二酸化炭素の大氣中の割合は？"

s1C0="\nあれ これはネコ？ ぢゃないのか？\n「僕はここだよ。\nん？\n「ちょっと次元が違ふ所・・・。まあ それはいいとして。\n「それは 文字 C だね。\n「それを動かして どこかへ置かなきゃいけないかも知れないし 置かなくていいかもしれない。\n？？？なんだそれ。\n「ここには 問題が3つあるみたいなんだ。その答へになるものを イコールの右に置くんだらうね。\n「見たところ 數字や小數點？は持てるけど C と O と H と X は持てなくて 動かすみたいだね。\n・・・・。\n「あと ここには 二人の 自称 科學者がゐるよ。彼らと話せば 問題を解くヒントが得られさうだね。\nてか なんでこんなことしなきゃ・・・。\n「ぢゃ がんばってね〜。あ さうだ。言ひ忘れてた。\n・・・なんだよ。\n「もし行き詰まったら 右下にある R へ飛びこむといいよ。それぢゃ！。\n飛びこむ？？？。なんか 色々説明不足だろ・・・"

s1S0="\n「私は 科學者の端くれとして 現在の環境問題の捉へ方に對し 大いに 危：き：惧：ぐ：してゐます。\n？？？。 あの〜 まう少し分かりやすく 話してもらへます？。\n「ああ すみません・・・。 私は ただ いはゆる 環境問題といふものが 問題である と訴へたいだけなのです。\n環境問題が・・・問題？ ですか？。\n「さうです。 え〜とですね。 要は 地球環境に問題があるのではなく 現在の地球環境の扱ひ方 とらへ方に問題がある と言ってゐるのです。\nはあ・・・。\n「例へば 地球温暖化問題 といふものがあります。\nああ 地球温暖化ね！。 それなら 知ってますよ。 テレビでも よくやってゐますよね。\n「はい。 私達の見地から それについての番組などを見ると 科學的に見て それらは 不正確な情報です。\n・・・えっと・・・どういふことかな？。\n「テレビで言ってゐることは 間違ってゐる と言ひたいのです。\nえ？。 いや でも 學校でも習ふだらうし 何よりも 政府が 環境問題に取り組んでゐるんぢゃないんですか？。\n「さうです。 そこがやっかいなところなのです。 間違った事を 學校で教へ 國や自治體が政策として實行してゐる・・・。\nいやいや それはないでせう。 だって 科學者の人たちが集まって決めたやうなことを 教へたり 政治家がやったりするんぢゃないんですか？。\n「もちろん さうあって欲しいんですが 私どもから見て さういった いはゆる ＜科學者＞は 科學をやってゐません。\n？？？。 どういふことかな？{e.bS.m1:s1S1}"

s1S1="\n「温室効果ガスといふ言葉をご存知ですか？。\nえっと あれだよね 地球温暖化の原因になってるっていふ・・・・・二酸化炭素！！。\n「確かにそれも さうなのですが それよりもっと 温室効果の高いものがあります。\nえ？。・・・うーん 天然ガス とか？。\n「水蒸気です。\n水蒸氣・・・水！？。\n「さうです 水です。 水は大氣中にあって 最も温室効果に貢献してゐます。\n貢献・・・って・・・\n「貢献です。 それがなければ 地球は人類の住めない不毛の地です。\nでも あれでしょ？。 最近二酸化炭素が増えて 温暖化になってゐるんですよね？。\n「なぜ さう言へるのですか？。\nなぜって・・・科學者がさう言ってるでしょ？。\n「科學者がさう言ってゐるから といふ理由で 物事を考へるのは 非科學的ですね。\n二酸化炭素が温室効果ガスで それが増えたから 温暖化が起こってゐるんではないんですか？。\n「大氣中の二酸化炭素の割合は およそ400ppm です。\nえ？。\n「0.04パーセントと言ったら分かりやすいでせうか？。 對して水蒸氣の割合は 湿度によりますが だいたい5パーセント程度です。\n水の方が 全然多いな・・・。\n「さうです。 仮に二酸化炭素の割合が 今の十倍になったとして その大氣中の割合は 0.4パーセントです。 水蒸氣には及びません。\n「そして 水蒸氣の方が 温室効果が高いのです。 私の言はうとしてゐることが分かりますか？。\n・・・二酸化炭素が温暖化の原因・・・ではない？。\n「さうです。 科學的なデータから 合理的に考へれば 二酸化炭素が増えても 地球の気温にほとんど影響を與へないであろうことくらい 小學生でも分かります。 ですが 殘念ながら その小學生達が通ふ學校において 非科學的な迷信が常に教へられてゐるのです。\nどうして・・・？。\n「さて どうしてでせう？"

s1J0="\n「私は ある政府機関所属の サイエンティストだ。\n「現在 地球環境は 危機的状態に置かれてゐる。我々人類が 協力してこれに對処しなければ 将來取り返しのつかない事態を招くことになるだらう。\nはあ・・・。\n「はあ・・・ではないぞ。真剣に考へてみなさい。あなたの行動のひとつひとつが 地球を守るか 滅ぼすか 決めると言っても過言ではないのだ。\n・・・って言はれても 例へばどんなことを氣をつければいいんですか？。\n「3Rだよ君。リデュース。リユーズ。リサイクル。\nあー なんか學校できいたことあるな。\n「聞いたことがある？。 それで環境が守れると思ふのかね？。 實踐しなければ意味ないのだよ。\n・・・で 何すればいいんでしたっけ？。\n「なんと！。 いやはや 君のやうな者が少數派であってくれれば良いのだが・・・。\n「よろしい。ひとつひとつ説明するから よく聞きなさい。\n・・・なんか偉さうだな このひと・・・。\n「何か言ったか？。\nい いえ 何でもないです・・・"

s1J1="\n「まずは リデュース！。\n「これは 削：さく：減：げん：する といふことだ。\nぢゃあ はじめから さう言ってよね。\n「人の話を遮るものではない！。 最後までよううううく 聞きなさい！。\nうわっ めんどくさいやつだ・・・。\n「うん？。\nいや なんでも・・・\n「人類は 特に先進国においては その富に甘んじたことにより 人々の消費に歯止めが効かなくなっている。\n・・・。\n「・・・。\n・・・。\n「おい！。\nえ？。 何？。\n「ナニ ではない！。 ちゃんと聴いてるのか！。\nいや あんたが 話を遮るな とか言ったから黙ってるだけでしょ。\n「聴いてゐるなら 相槌くらい打ちなさい！。\nはあ・・・。\n「大量消費には 大量のエネルギーが必要だ。\n「そもそも エネルギーは 何を消費することにより得られてゐるか知ってゐるか？。\nえ？。 食べもの？。\n「食物は無論だが 昨今の経済活動に欠かせないエネルギー源があるであらう？。\n・・・あのー もうちょっと分かりやすい日本語でよろしく。\n「全く教養のない人間はこれだから困る。\n「そもそも礼儀がなっておらん。それが人にものを聞く態度か？。\nいや べつに何も尋ねてないし。\n「お前が無知であることを憐み 教えてやらうといふのだらう。\nあんたこそ無礼だな。\n「なんだと！。\nはあ まういいや さいならー"

s1c="\n「あなたは 私。\n「私は 世界。\nえ？。 なに？。 だれ？。\n「それでは 次に行：い：きませう{p.0,3.n,Ex}{e.un.l}{e.c1.m1:s2}"

s2="\n「ねえねえ 突然だけど ネコって好き？{da}{e.b=0.m0:s2Q1}{e.b=1.m0:s2Q2}{e.b=2.m0:s2Q3}{e.b=3.m0:s2Q4}{e.b=4.m0:s2Q5}{e.vP.m1:s2P}{e.vI.m1:s2I}{e.vH.m1:s2H}{e.vN.m1:s2N}{e.bJ.m1:s2J0}{e.bB.m1:s2B0}{e.e/.m1:s2Not}{e.uR.r}{e.==.m1:s2c}{ch.好き,s2_1.きらい,s2_2.ふつう,s2_3}"

s2Q1="\n新型コロナウイルスは"

s2Q2="\nPCR検査をして陽性になるといふことは"

s2Q3="\nマスクをするのは"

s2Q4="\nワクチンを打つのは"

s2Q5="\n人と接触するのは"

s2P="\n存在してゐる"

s2I="\n感染したといふこと"

s2H="\n有害で危険だ"

s2N="\n必須なことだ"

s2Not="\nNOT"

s2J0="\n「こんにちは！"

s2B0="\n「おはやうございます"

s2_1="\n「さうなんだ！。\n「うれしいな。\nいや べつに一般的に といふだけで 特別お前のことが ってわけでもないんだケド。\n「それでもうれしいよ。\n「ネコはね 通常人間が感じてゐない世界を見てゐるんだ。\nそりゃ 人間と違ふ動物なんだから さういふもんだろ？。\n「まあ さうだけど その世界は とってもヒトにとって大事なんだよ。\nふーん。\n「あ なんか全然興味ない言ひ方・・・\nまあね。\n「ふん！。 いいよ！。 きっとそのうち氣になって仕方なくなるんだから〜。"

s2_2="\n「そっかー そりゃ殘念。\n「まあ ヒトそれぞれ好みが違ふし 仕方ないかー。\nあからさまに殘念さうだね。\n「まあ 嫌はれるのは 好きぢゃないしね・・・。\nべつに お前が特別嫌ひってことでもないよ。\n「さうなの！。 やったー！。\nなんか開きなほるの早いな・・・"

s2_3="\n「ふつう・・・ですかー。\nなにか？。\n「いや べつに それはそれで いいんだけどねー。\n「・・・なんかかう ふつう って ほんとはイヤなんだけど それ言ひたくないときに使ふやうなイメージが・・。\nいや 單純に興味ないだけだから。\n嫌ひでもないし 好きでもない。\n「ふーん そっかー・・・。\nなんだよ。\n「ぼくちん かわいいぴょん！。\nはい？"

s2c="\n「すごいね！ クリアだよ！{da}"

msgR="\nまう一度 やってみませう"

msgW="\n何が起：お：こった？"

nubatama="\nぬばたまの 世は難しく 思へれど。   \n明けて見ゆるは 唯大河なり"

s090="\n「觀：かん：念：ねん：が感：かん：情：じやう：を生み 感情が行：かう：動：どう：を促：うなが：す。\n「あなたの世界は あなたの觀念によって 文字通り 創：さう：造：ざう：されてゐる。\n「そのことを忘：わす：れるといふのも あなたが望：のぞ：み 創：つく：り出したこと。\n「觀念は あなたの意：い：思：し：によって 變：か：えることができる。\n「觀念が世界を創造してゐる といふことは あなたの意思が 世界を創造できる といふこと。\n「あなたの周：しう：囲：ゐ：の すべての状：じゃう：況：きゃう：を あなたが コントロールできる といふこと。\n「それを實：じつ：行：かう：するも しないも すべて あなただけの意思に委：ゆだ：ねられてゐる。"

s080="\n「肉：にく：體：たい：があるから精：せい：神：しん：がある といふのは それを正しいとあなたが決めたのであれば 正しい。\n「精神があるから 肉體がある といふのは 正しい。\n「そのことからのみ 肉體があるから精神がある といふ考へを肯：こう：定：てい：することができる。\n「なぜなら 精：せい：神：しん：を先 とするのであれば あなたの觀：かん：念：ねん：が 正しさの基：もと：をなしてゐるからである。\n「精神が肉體の前にある といふことによってのみ 肉體が前であってもよいし 精神が前であってもよい といふ自由が生じる。\n「どちらでも あなたの好きなやうに 選んでよい といふことになる。"

s030="\n「現：げん：在：ざい：の社：しゃ：會：かい：で 最も難：むづか：しいことは すべてが簡：かん：單：たん：であることを 理：り：解：かい：することである。\n「この世界の法：はふ：則：そく： ルールは 非：ひ：常：じゃう：に簡單で ひとつしかない。\n「それは 與：あた：へたものが 返ってくる といふ法則 ただひとつである。\n「しいて まうひとつ あるとすれば。\n「あなたは 存：そん：在：ざい：してゐる といふことだ。"

s020="\n「ひとつしかない世界の中に あなたが生きてゐるといふのは 實：じつ：は ひとつの觀：かん：念：ねん：である。\n「觀念といふのは あなたの心が決めてゐる 信じてゐることがらである。\n「それは あなたの心の中にある 等：とう：式：しき：である。\n「せかいは ひとつ せかいは おなじ せかいは まるい ただひとつ。\n「これは すべて あなたの心の中にある 等式 つまり 觀念である。\n「その觀念を 持ち續：つづ：ける自由も その觀念を 別：べつ：のものに變：か：へる自：じ：由：いう：も あなたは持ってゐる。"

s3="\nあれ？ なんだここ？{e.bA.m1:s3A0}{e.bB.m1:s3B0}{e.bD.ap1=2}{e.bB.t3:a=4=4}{d.==}{e.==.m1:s3c}"

s3A0="\n「ここは のぞみの間：ま：。ぼくは操画をつくりたいんだ。\n操画？。\n「さう 操画。君達の言ふ ゲーム かな。\nそんなら ゲームって言ってよ 分かりづらいだろ？。\n「なんで 分かりやすく言はなきゃならないんだい？。\n相手が分かりやすい言葉を選ぶから コミュニケーションが成り立つんだろ？。\n「ぢゃあ 赤ちゃんと話：はな：すときも 赤ちゃんが分かりやすい言葉を選ばなきゃね。\n・・・何が言ひたい？。\n「別に喧：けん：嘩：か：を賣ってるわけぢゃないよ。でも 少なくとも僕は 君が分かりやすく話してくれることを期待してないし 君に對して 分かりやすく話さなきゃいけない理由も分からない。そんな僕とは 話してくれないのかな？。\n面倒な人だな。\n「面倒・・といふのは よく分からないけど 人と話して 理解してもらふのは 簡單なことではない ってことは分かるよ。\nなら 簡單に話せよ。\n「僕なりに簡單に話してるつもりだけど。\n「でも 君が理解し易さうな言葉を選んで 僕の使ひたい言葉を殺すのはイヤなんだ。\n「だって それだと 結局理：り：解：かい：してもらへてないってことだから。\nは？ 理解し易くなるだろ？。\n「そんなことないよ。僕といふ人間を理解してもらへないで 言葉の表面を理解した氣になられても ちょっと寂しいかな。\n・・・・・。"

s3B0="\n「思ったことは それ自體 価値があると思ふんだ。\n「確かに 誰かが言ったことに對して あれこれ言ふことだって 価値がある。\n「ただ それによって 誰：だれ：かの言ったこと 思ったことの価値が下がるわけではない。\n「思ったことは それが他の人にどう感じられるかによって 価値がうまれるんではなくて。\n「思ったことは それ自體に価値があるって 言ひたいんだ。\n「ぼくが ここに存在すること自體に 価値があるのと 同じやうにね。\n「だから ぼくは 自分の發した言葉が 人にどう思はれるかよりも 自分の發した言葉が 自分の思ったことに合ってゐるか のほうを大切にして 言葉を發してゐたいんだ。"

s3c="\n深く？。 それとも 廣く？{p.2,4.n,Ex}{e.un.l}{e.c3.m1:s4}"

s4="\n心の形は 宇宙の形。\nまとまっってゐるやうには 見へない。\nそれでいい。{e.bE.m1:s4E0}{e.bF.m1:s4F0}"

s4E0="\n令和5年 5月19日 零時24分。\nさっきまで リコリス・リコイルを観てゐた。\n最終話を観終えた。\n今度また最初から観たい。\n話はとても面白かったが 絵が非常に魅力的だ。\nこんな絵が描けたら と思ふ。\nいや 描きたい と思ふ。\n時を重ねるたびに 確信が強くなってゐく。\n他人の目など 本當にどうでもいい といふ確信だ。\nそんなんでは 仕事ができない。さう言ふ人もゐるだらう。\n一人で生きてゐるのではない。周りと合はせなさい。\nさう言ふ人もゐるだらう。\nさう言ふ人は さうやって生きればよろしい。\n私は その逆を生きてみせる。\nそれもまた 貴重な人生。\nどんなに 他人から否定されやうが どんなに 他人を否定しやうが\n自分だけは。自分だけは 肯定して生きる。\nそれがすべての原點。生まれたときから持ってゐた 自分の基本。\nここに かうして生まれてきた 自分を 信じやう。\nその他のことは それができた後にあるもの。\nすべての人間がさうであるやうに 私も。\n生きていくために必要なものは すべて身につけて生まれてきた。\nただ この身をまかせ 心にまかせ 泳いでいかう。{e.b0.jl0}{d.==}{e.==.m1:s0c}"

s4F0="\n令和5年 6月8日 11時28分。\nこの操画のコードを調整してゐた。\nキャンバスの幅や高さを讀みこみ その値によって動くやうにできた。\n今までは 幅や高さを別途指定してゐたので キャンバスサイズを變へたときは その値も變へなければならなかった。\nかなりの部分變更が必要だったが コードはよりシンプルになったと思ふ。\n手直しできさうなところは たくさんある。\nとりあへずの目標は この操画を簡單にＳＤＬなどのフレームワークへ移植できるやうにすることだ。\nちょっと括弧のテストをしたい（括弧）。\nうまくいったみたいだ"


msgs=[("initMsg",initMsg),("s0C0",s0C0),("s0C1",s0C1),("s0C2",s0C2),("s0C3",s0C3),("s0c",s0c),("s0C4",s0C4),("s1",s1),("s1Q1",s1Q1),("s1Q2",s1Q2),("s1Q3",s1Q3),("s1C0",s1C0),("s1S0",s1S0),("s1S1",s1S1),("s1J0",s1J0),("s1J1",s1J1),("s1c",s1c),("s2",s2),("s2Q1",s2Q1),("s2Q2",s2Q2),("s2Q3",s2Q3),("s2Q4",s2Q4),("s2Q5",s2Q5),("s2P",s2P),("s2I",s2I),("s2H",s2H),("s2N",s2N),("s2Not",s2Not),("s2J0",s2J0),("s2B0",s2B0),("s2_1",s2_1),("s2_2",s2_2),("s2_3",s2_3),("s2c",s2c),("msgR",msgR),("msgW",msgW),("nubatama",nubatama),("s090",s090),("s080",s080),("s030",s030),("s020",s020),("s3",s3),("s3A0",s3A0),("s3B0",s3B0),("s3c",s3c),("s4",s4),("s4E0",s4E0),("s4F0",s4F0)]